RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_edim_biss.c
/*!
    \file    gd32h77x_78x_edim_biss.c
    \brief   EDIM BISSC driver

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_78x_edim_biss.h"

#define MAX_SLAVE_NUMBER          8U

/*!
    \brief      deinit EDIM_BISS (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_biss_deinit(void)
{
    rcu_periph_reset_enable(RCU_BISSRST);
    rcu_periph_reset_disable(RCU_BISSRST);
}

/*!
    \brief      initialize EDIM_BISS init parameter struct with a default value (API_ID(0x0002U))
    \param[in]  initpara: init parameter struct
    \param[out] none
    \retval     none
*/
void edim_biss_init_parameter_struct_para_init(edim_biss_init_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(EDIM_BISS_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        initpara->ma_force_control_level = EDIM_BISS_MA_NO_FORCE_CONTROL;
        initpara->ma_prescaler = 0U;
        initpara->n_slave = 0U;
        for(uint32_t cnt = 0U; cnt < 8U; cnt++) {
            initpara->slave_config[cnt].crc_init_value = 0U;
            initpara->slave_config[cnt].crc_poly = EDIM_BISS_SLAVE_CRC_NO_CRC;
            initpara->slave_config[cnt].data_length = 1U;
        }
    }
}

/*!
    \brief      initialize EDIM_BISS configuration (API_ID(0x0003U))
    \param[in]  init_struct: init parameter struct
                  ma_prescaler: prescaler value of the EDIM_BISS clock, fMA = fPCLK / (x + 1), x = 7~32767
                  ma_force_control_level: EDIM_BISS_MA_NO_FORCE_CONTROL,
                                          EDIM_BISS_MA_FORCE_LEVEL_LOW, EDIM_BISS_MA_FORCE_LEVEL_HIGH
                  n_slave: number of connected slave, 0~8
                  slave_config: pointer to slave configuration structure
                                data_length: length of process data in bits, 1~64
                                crc_poly: EDIM_BISS_SLAVE_CRC_NO_CRC, EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC3_0x0B,
                                          EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC4_0x13, EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC5_0x25,
                                          EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC6_0x43, EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC7_0x89,
                                          EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC8_0x12F, EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC16_0x190D9,
                                          EDIM_BISS_SLAVE_CRC_CUSTOM(x), x is a maximum of 8-bit crc polynomial and the lowest bit is 1
                                crc_init_value: initial value for crc calculation, 0~0xFFFF
    \param[out] none
    \retval     none
*/
void edim_biss_init(edim_biss_init_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(EDIM_BISS_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg_tmp;
        uint32_t cnt_slave;

        reg_tmp = EDIM_BISS_CCFG2;
        reg_tmp &= (~(EDIM_BISS_CCFG2_MAFRE | EDIM_BISS_CCFG2_MALVL | EDIM_BISS_CCFG2_MACSEL));
        reg_tmp |= ((CTL_MAFRE(init_struct->ma_prescaler) & EDIM_BISS_CCFG2_MAFRE) |
                    (init_struct->ma_force_control_level & (EDIM_BISS_CCFG2_MACSEL | EDIM_BISS_CCFG2_MALVL)));
        EDIM_BISS_CCFG2 = reg_tmp;

        if(init_struct->n_slave <= MAX_SLAVE_NUMBER) {
            for(cnt_slave = 0U; cnt_slave < init_struct->n_slave; cnt_slave++) {
                reg_tmp = (((init_struct->slave_config[cnt_slave].crc_init_value << 16U) & EDIM_BISS_SnPDTCFG_CRCIVAL) |
                           (init_struct->slave_config[cnt_slave].crc_poly & (EDIM_BISS_SnPDTCFG_CRCPOLY | EDIM_BISS_SnPDTCFG_CRCMSEL)) |
                           (((init_struct->slave_config[cnt_slave].data_length - 1U) << 0U) & EDIM_BISS_SnPDTCFG_PDLEN));


                EDIM_BISS_SnPDTCFG(cnt_slave) = reg_tmp;
            }
        }

        for(; cnt_slave < MAX_SLAVE_NUMBER; cnt_slave++) {
            EDIM_BISS_SnPDTCFG(cnt_slave) = 0U;
        }
    }
}

/*!
    \brief      initialize BiSS-C slave and clear rest of the slave (API_ID(0x0004U))
    \param[in]  n_slave: number of BiSS-C slave to be config, 0~8
    \param[in]  slave_config: pointer to all slave parameter's struct array, the array size should equal to n_slave
                  data_length: slave data length, x = 1~64
                  crc_poly: slave crc polynomial configuration,
                            EDIM_BISS_SLAVE_CRC_NO_CRC,
                            EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC3_0x0B,
                            EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC4_0x13,
                            EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC5_0x25,
                            EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC6_0x43,
                            EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC7_0x89,
                            EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC8_0x12F,
                            EDIM_BISS_SLAVE_CRC_PREDEFINED_CRC16_0x190D9,
                            EDIM_BISS_SLAVE_CRC_CUSTOM(x), x is a maximum of 8-bit crc polynomial and the lowest bit is 1
                  crc_init_value: slave crc init value configuration, 0~0xFFFF
    \param[out] none
    \retval     none
*/
void edim_biss_slave_config(uint32_t n_slave, edim_biss_slave_parameter_struct slave_config[])
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(slave_config)) {
        fw_debug_report_err(EDIM_BISS_MODULE_ID, API_ID(0x0004U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg_tmp;
        uint32_t cnt_slave;

        if(n_slave <= MAX_SLAVE_NUMBER) {
            for(cnt_slave = 0U; cnt_slave < n_slave; cnt_slave++) {
                reg_tmp = (((slave_config[cnt_slave].crc_init_value << 16U) & EDIM_BISS_SnPDTCFG_CRCIVAL) |
                           (slave_config[cnt_slave].crc_poly & EDIM_BISS_SnPDTCFG_CRCPOLY) |
                           (((slave_config[cnt_slave].data_length - 1U) << 0U) & EDIM_BISS_SnPDTCFG_PDLEN));

