RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_edim_biss.c
    reg_tmp = EDIM_BISS_CCFG2;

    if(0U != (reg_tmp & EDIM_BISS_CCFG2_ADTEN)){
        if(0U != (reg_tmp & EDIM_BISS_CCFG2_FCTL)){
            reg_tmp &= ~(EDIM_BISS_CCFG2_ADTEN);
            while(RESET == edim_biss_flag_get(EDIM_BISS_FLAG_EOFT)){
            }
            while(RESET != edim_biss_flag_get(EDIM_BISS_FLAG_EOFT)){
            }
            EDIM_BISS_CCFG2 = reg_tmp;
            while(RESET == edim_biss_flag_get(EDIM_BISS_FLAG_EOFT)){
            }
        }
        else{
            reg_tmp &= ~(EDIM_BISS_CCFG2_ADTEN);
            EDIM_BISS_CCFG2 = reg_tmp;
        }
    }

    reg_tmp &= ~(EDIM_BISS_CCFG2_FCTL | EDIM_BISS_CCFG2_ADTEN);
    reg_tmp |= frame_config;
    EDIM_BISS_CCFG2 = reg_tmp;
}

/*!
    \brief      configure prescale value of automatic data transmission mode (API_ID(0x000DU))
    \param[in]  prescaler: prescale value for ADT mode
                only one parameter can be selected which is shown as below:
      \arg        EDIM_BISS_AUTO_DATA_TRANSMIT_RATE_MAX: automatic send new BiSS-C frame after last frame has been finished
      \arg        EDIM_BISS_AUTO_DATA_TRANSMIT_EXT_TRIGGER: automatic send new BiSS-C frame by external trigger
      \arg        EDIM_BISS_AUTO_DATA_TRANSMIT_RATE_DIV(x): automatic send new BiSS-C frame by predefined ADT frequency, x = 0x000006, 0x000008, ... ,0x200000 (even number)
    \param[out] none
    \retval     none
*/
void edim_biss_auto_transmission_config(uint32_t prescaler)
{
    EDIM_BISS_FREP = prescaler;
}

/*!
    \brief      store process data CRC value into EDIM_BISS_SnDATA0/1 (API_ID(0x000EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_biss_store_crc_enable(void)
{
    EDIM_BISS_CCFG1 &= (~EDIM_BISS_CCFG1_CRCSEN);
}

/*!
    \brief      not store process data CRC value into EDIM_BISS_SnDATA0/1 (API_ID(0x000FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_biss_store_crc_disable(void)
{
    EDIM_BISS_CCFG1 |= EDIM_BISS_CCFG1_CRCSEN;
}

/*!
    \brief      select ram bank number used for process data (API_ID(0x0010U))
    \param[in]  rambank_num: number of RAM banks, 1 or 2
    \param[out] none
    \retval     none
*/
void edim_biss_rambank_number_select(uint32_t rambank_num)
{
    if(1U == rambank_num) {
        EDIM_BISS_CCFG1 |= EDIM_BISS_CCFG1_RAMNUM;
    } else if(2U == rambank_num) {
        EDIM_BISS_CCFG1 &= (~EDIM_BISS_CCFG1_RAMNUM);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      enable automatic ram bank switching (API_ID(0x0011U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_biss_rambank_auto_switching_enable(void)
{
    EDIM_BISS_CCFG2 &= (~EDIM_BISS_CCFG2_RBSWDIS);
}

/*!
    \brief      disable automatic ram bank switching (API_ID(0x0012U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_biss_rambank_auto_switching_disable(void)
{
    EDIM_BISS_CCFG2 |= EDIM_BISS_CCFG2_RBSWDIS;
}

/*!
    \brief      force ram bank switching (API_ID(0x0013U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_biss_rambank_force_switching(void)
{
    if(RESET == (EDIM_BISS_CCFG2 & EDIM_BISS_CCFG2_RBSW)) {
        EDIM_BISS_CCFG2 |= EDIM_BISS_CCFG2_RBSW;
    } else {
        EDIM_BISS_CCFG2 &= (~EDIM_BISS_CCFG2_RBSW);
    }
}

/*!
    \brief      select MA signal level at the end of frame (API_ID(0x0014U))
    \param[in]  ma_level: MA signal level
                only one parameter can be selected which is shown as below:
      \arg        EDIM_BISS_MA_HIGH_END: after the slave timeout is detected on SL, MA changes to the digital high level
      \arg        EDIM_BISS_MA_MAINTAIN_END: MA maintains level until the next frame begins
    \param[out] none
    \retval     none
*/
void edim_biss_ma_end_level_select(uint32_t ma_level)
{
    uint32_t reg_tmp;

    reg_tmp = EDIM_BISS_CCFG1;
    reg_tmp &= (~EDIM_BISS_CCFG1_MASEL);
    reg_tmp |= (ma_level & EDIM_BISS_CCFG1_MASEL);
    EDIM_BISS_CCFG1 = reg_tmp;
}

/*!
    \brief      configure master clock prescaler for process data (API_ID(0x0015U))
    \param[in]  prescaler: prescaler value, x = 7~32767, fMA = fPCLK / (x + 1)
    \param[out] none
    \retval     none
*/
void edim_biss_ma_prescaler_config(uint32_t prescaler)
{
    uint32_t reg_tmp;
    
    reg_tmp = EDIM_BISS_CCFG2;
    reg_tmp &= (~EDIM_BISS_CCFG2_MAFRE);
    reg_tmp |= CTL_MAFRE(prescaler) & EDIM_BISS_CCFG2_MAFRE;
    EDIM_BISS_CCFG2 = reg_tmp;
}

/*!
    \brief      enable dma for BiSS-C slave data receive (API_ID(0x0016U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_biss_dma_enable(void)
{
    EDIM_BISS_DFCTL |= EDIM_BISS_DFCTL_DFEN;
}

/*!
    \brief      disable dma for BiSS-C slave data receive (API_ID(0x0017U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_biss_dma_disable(void)
{
    EDIM_BISS_DFCTL &= (~EDIM_BISS_DFCTL_DFEN);
}

/*!
    \brief      flush dma fifo (API_ID(0x0018U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_biss_dma_flush(void)
{
    EDIM_BISS_DFCTL |= EDIM_BISS_DFCTL_FIFOFH;
}

/*!
    \brief      select slave process data to be loaded into DMA FIFO (API_ID(0x0019U))
    \param[in]  reg_selected: select slave n data register,
                one or more parameter can be selected which is shown as below:
      \arg        EDIM_BISS_DMA_SEL_SLV0_DATA0: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S0RDATA0 register
      \arg        EDIM_BISS_DMA_SEL_SLV0_DATA1: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S0RDATA1 register
      \arg        EDIM_BISS_DMA_SEL_SLV1_DATA0: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S1RDATA0 register
      \arg        EDIM_BISS_DMA_SEL_SLV1_DATA1: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S1RDATA1 register
      \arg        EDIM_BISS_DMA_SEL_SLV2_DATA0: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S2RDATA0 register
      \arg        EDIM_BISS_DMA_SEL_SLV2_DATA1: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S2RDATA1 register
      \arg        EDIM_BISS_DMA_SEL_SLV3_DATA0: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S3RDATA0 register
      \arg        EDIM_BISS_DMA_SEL_SLV3_DATA1: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S3RDATA1 register
      \arg        EDIM_BISS_DMA_SEL_SLV4_DATA0: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S4RDATA0 register
      \arg        EDIM_BISS_DMA_SEL_SLV4_DATA1: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S4RDATA1 register
      \arg        EDIM_BISS_DMA_SEL_SLV5_DATA0: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S5RDATA0 register
      \arg        EDIM_BISS_DMA_SEL_SLV5_DATA1: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S5RDATA1 register
      \arg        EDIM_BISS_DMA_SEL_SLV6_DATA0: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S6RDATA0 register
      \arg        EDIM_BISS_DMA_SEL_SLV6_DATA1: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S6RDATA1 register
      \arg        EDIM_BISS_DMA_SEL_SLV7_DATA0: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S7RDATA0 register
      \arg        EDIM_BISS_DMA_SEL_SLV7_DATA1: EDIM_BISS DMA request and FIFO enable for EDIM_BISS_S7RDATA1 register
    \param[out] none
    \retval     none
*/
void edim_biss_dma_select(uint32_t reg_selected)
{
    uint32_t reg_tmp;

    reg_tmp = EDIM_BISS_DFCTL;
    reg_tmp &= (~(EDIM_BISS_DFCTL_DMA_DFEN));
    reg_tmp |= (reg_selected & EDIM_BISS_DFCTL_DMA_DFEN);
    EDIM_BISS_DFCTL = reg_tmp;
}

/*!
    \brief      read EDIM_BISS SnRDATA0/1 (API_ID(0x001AU))
    \param[in]  slave_id: slave id, 0~7
    \param[out] none
    \retval     the received data value: 0~0xFFFFFFFFFFFFFFFF
*/
uint64_t edim_biss_data_read(uint32_t slave_id)
{
    uint64_t reg1;
    uint64_t reg2;
    reg1 = (uint64_t)EDIM_BISS_SnDATA0(slave_id);
    reg2 = ((uint64_t)EDIM_BISS_SnDATA1(slave_id)) << 32U;
    return (reg1 | reg2);
}

/*!
    \brief      configure the count value from the BiSS frame's slave response ACK to the CDM timeout confirmation bit (API_ID(0x001BU))
    \param[in]  frame_cnt: frame count value, 0~0x1FFF
    \param[out] none
    \retval     none
*/
void edim_biss_frame_count_value_config(uint32_t frame_cnt)
{
    uint32_t reg_tmp;

    reg_tmp = EDIM_BISS_CNTINTEN;
    reg_tmp &= (~(EDIM_BISS_CNTINTEN_FCNT));
    reg_tmp |= ((frame_cnt << 16) & EDIM_BISS_CNTINTEN_FCNT);
    EDIM_BISS_CNTINTEN = reg_tmp;
}

/*!
    \brief      get the number of valid register from addressed slave in register communication (API_ID(0x001CU))
    \param[in]  none
    \param[out] none
    \retval     the valid register number: 0~0x3F
*/
uint8_t edim_biss_valid_reg_num_get(void)
{
    return (uint8_t)((EDIM_BISS_STAT0 & EDIM_BISS_STAT0_VREGNUM) >> 24);
}

/*!
    \brief      get the number of slaves in control communication (API_ID(0x001DU))
    \param[in]  none
    \param[out] none
    \retval     the slave number: 0~0x09
*/
uint8_t edim_biss_slave_num_get(void)
{
    return (uint8_t)((EDIM_BISS_STAT1 & EDIM_BISS_STAT1_SLNUM) >> 16);
}

/*!
    \brief      enable EDIM_BISS interrupt (API_ID(0x001EU))
    \param[in]  interrupt: EDIM_BISS interrupt
                one or more parameter can be selected which is shown as below:
      \arg        EDIM_BISS_INT_EODTIE: end of data transmission interrupt enable
      \arg        EDIM_BISS_INT_CCERRIE: control communication error interrupt enable
      \arg        EDIM_BISS_INT_PDTERRIE: process data transmission error interrupt enable
      \arg        EDIM_BISS_INT_SERRIE: start bit error interrupt enable
      \arg        EDIM_BISS_INT_ADTERRIE: automatic data transmission error interrupt enable
      \arg        EDIM_BISS_INT_DMATOIE: DMA request timeout error interrupt enable
      \arg        EDIM_BISS_INT_FIFOUNRIE: FIFO underrun interrupt enable
      \arg        EDIM_BISS_INT_FIFOOVRIE: FIFO overrun interrupt enable
    \param[out] none
    \retval     none
*/
void edim_biss_interrupt_enable(uint32_t interrupt)
{
    EDIM_BISS_CNTINTEN |= (interrupt & EDIM_BISS_INTEN_MASK);
}

/*!
    \brief      disable EDIM_BISS interrupt (API_ID(0x001FU))
    \param[in]  interrupt: EDIM_BISS interrupt
                one or more parameter can be selected which is shown as below:
      \arg        EDIM_BISS_INT_EODTIE: end of data transmission interrupt enable
      \arg        EDIM_BISS_INT_CCERRIE: control communication error interrupt enable
      \arg        EDIM_BISS_INT_PDTERRIE: process data transmission error interrupt enable
      \arg        EDIM_BISS_INT_SERRIE: start bit error interrupt enable
      \arg        EDIM_BISS_INT_ADTERRIE: automatic data transmission error interrupt enable
      \arg        EDIM_BISS_INT_DMATOIE: DMA request timeout error interrupt enable
      \arg        EDIM_BISS_INT_FIFOUNRIE: FIFO underrun interrupt enable
      \arg        EDIM_BISS_INT_FIFOOVRIE: FIFO overrun interrupt enable
    \param[out] none
    \retval     none
*/
void edim_biss_interrupt_disable(uint32_t interrupt)
{
    EDIM_BISS_CNTINTEN &= (~(interrupt & EDIM_BISS_INTEN_MASK));
}

/*!
    \brief      get EDIM_BISS flag (API_ID(0x0020U))
    \param[in]  flag: the EDIM_BISS flags
                only one parameter can be selected which is shown as below:
      \arg        EDIM_BISS_FLAG_EODT: data transmission finish flag
      \arg        EDIM_BISS_FLAG_EOFT: data transmission finish flag
      \arg        EDIM_BISS_FLAG_EOCC: control communication transmission finish flag
      \arg        EDIM_BISS_FLAG_CCERRN: no control communication transmission error flag
      \arg        EDIM_BISS_FLAG_PDTERRN: no data transmission error flag
      \arg        EDIM_BISS_FLAG_SERRN: no start bit error flag
      \arg        EDIM_BISS_FLAG_ADTERRN: no automatic data transmission error flag
      \arg        EDIM_BISS_FLAG_INERRN: no internal error flag
      \arg        EDIM_BISS_FLAG_SLAVE0_DATA_VALID: slave 0 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE1_DATA_VALID: slave 1 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE2_DATA_VALID: slave 2 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE3_DATA_VALID: slave 3 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE4_DATA_VALID: slave 4 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE5_DATA_VALID: slave 5 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE6_DATA_VALID: slave 6 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE7_DATA_VALID: slave 7 data valid flag
      \arg        EDIM_BISS_FLAG_CDS: current CDS value
      \arg        EDIM_BISS_FLAG_CDMTOF: CDM timeout complete flag
      \arg        EDIM_BISS_FLAG_SLIN: current SL line level
      \arg        EDIM_BISS_FLAG_CDSBU: current CDS value (backup)
      \arg        EDIM_BISS_FLAG_RBSWERR: ram bank error flag
      \arg        EDIM_BISS_FLAG_DMATO: DMA timeout error flag
      \arg        EDIM_BISS_FLAG_FIFOUNR: FIFO underrun error flag
      \arg        EDIM_BISS_FLAG_FIFOOVR: FIFO overrun error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_biss_flag_get(edim_biss_flag_enum flag)
{
    FlagStatus return_val = RESET;
    /* get the BiSS-C flag */
    if(RESET != (EDIM_BISS_REG_VAL(EDIM_BISS, (uint32_t)flag) & BIT(EDIM_BISS_BIT_POS(flag)))) {
        return_val = SET;
    } else {
        return_val = RESET;
    }
    return return_val;
}

/*!
    \brief      clear EDIM_BISS flag (API_ID(0x0021U))
    \param[in]  flag: the EDIM_BISS flags
                only one parameter can be selected which is shown as below:
      \arg        EDIM_BISS_FLAG_EODT: data transmission finish flag
      \arg        EDIM_BISS_FLAG_EOFT: data transmission finish flag
      \arg        EDIM_BISS_FLAG_EOCC: control communication transmission finish flag
      \arg        EDIM_BISS_FLAG_CCERRN: no control communication transmission error flag
      \arg        EDIM_BISS_FLAG_PDTERRN: no data transmission error flag
      \arg        EDIM_BISS_FLAG_SERRN: no start bit error flag
      \arg        EDIM_BISS_FLAG_ADTERRN: no automatic data transmission error flag
      \arg        EDIM_BISS_FLAG_SLAVE0_DATA_VALID: slave 0 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE1_DATA_VALID: slave 1 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE2_DATA_VALID: slave 2 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE3_DATA_VALID: slave 3 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE4_DATA_VALID: slave 4 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE5_DATA_VALID: slave 5 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE6_DATA_VALID: slave 6 data valid flag
      \arg        EDIM_BISS_FLAG_SLAVE7_DATA_VALID: slave 7 data valid flag
      \arg        EDIM_BISS_FLAG_CDS: current CDS value
      \arg        EDIM_BISS_FLAG_CDMTOF: CDM timeout complete flag
      \arg        EDIM_BISS_FLAG_SLIN: current SL line level
      \arg        EDIM_BISS_FLAG_CDSBU: current CDS value (backup)
      \arg        EDIM_BISS_FLAG_RBSWERR: ram bank error flag
      \arg        EDIM_BISS_FLAG_DMATO: DMA timeout error flag
      \arg        EDIM_BISS_FLAG_FIFOUNR: FIFO underrun error flag
      \arg        EDIM_BISS_FLAG_FIFOOVR: FIFO overrun error flag
    \param[out] none
    \retval     none
*/
void edim_biss_flag_clear(edim_biss_flag_enum flag)
{
    EDIM_BISS_REG_VAL(EDIM_BISS, (uint32_t)flag) = BIT(EDIM_BISS_BIT_POS(flag));
}

/*!
    \brief      get EDIM_BISS interrupt flag (API_ID(0x0022U))
    \param[in]  int_flag: the EDIM_BISS interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        EDIM_BISS_INT_FLAG_EODT: data transmission finish interrupt flag
      \arg        EDIM_BISS_INT_FLAG_CCERR: control communication transmission error interrupt flag
      \arg        EDIM_BISS_INT_FLAG_PDTERR: data transmission error interrupt flag
      \arg        EDIM_BISS_INT_FLAG_SERR: start bit error interrupt flag
      \arg        EDIM_BISS_INT_FLAG_ADTERR: automatic data transmission error interrupt flag
      \arg        EDIM_BISS_INT_FLAG_DMATO: DMA timeout error interrupt flag
      \arg        EDIM_BISS_INT_FLAG_FIFOUNR: FIFO underrun error interrupt flag
      \arg        EDIM_BISS_INT_FLAG_FIFOOVR: FIFO overrun error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_biss_interrupt_flag_get(edim_biss_interrupt_flag_enum int_flag)
{
    uint32_t ret1 = RESET;
    uint32_t ret2 = RESET;
    FlagStatus return_val = RESET;

