RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_edim_biss.c
    /* get the status of interrupt enable bit */
    ret1 = (EDIM_BISS_REG_VAL(EDIM_BISS, (uint32_t)int_flag) & BIT(EDIM_BISS_BIT_POS(int_flag)));
    /* get the status of interrupt flag */
    ret2 = (EDIM_BISS_REG_VAL2(EDIM_BISS, int_flag) & BIT(EDIM_BISS_BIT_POS2(int_flag)));

    if((EDIM_BISS_INT_FLAG_CCERR == int_flag) || (EDIM_BISS_INT_FLAG_PDTERR == int_flag) ||
       (EDIM_BISS_INT_FLAG_SERR == int_flag) || (EDIM_BISS_INT_FLAG_ADTERR == int_flag)) {
        if(SET == ret2) {
            ret2 = RESET;
        } else {
            ret2 = SET;
        }
    }
    if(ret1 && ret2) {
        return_val = SET;
    } else {
        return_val = RESET;
    }
    return return_val;
}

/*!
    \brief      clear EDIM_BISS interrupt flag (API_ID(0x0023U))
    \param[in]  int_flag: the EDIM_BISS interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        EDIM_BISS_INT_FLAG_EODT: data transmission finish interrupt flag
      \arg        EDIM_BISS_INT_FLAG_CCERR: control communication transmission error interrupt flag
      \arg        EDIM_BISS_INT_FLAG_PDTERR: data transmission error interrupt flag
      \arg        EDIM_BISS_INT_FLAG_SERR: start bit error interrupt flag
      \arg        EDIM_BISS_INT_FLAG_ADTERR: automatic data transmission error interrupt flag
      \arg        EDIM_BISS_INT_FLAG_DMATO: DMA timeout error interrupt flag
      \arg        EDIM_BISS_INT_FLAG_FIFOUNR: FIFO underrun error interrupt flag
      \arg        EDIM_BISS_INT_FLAG_FIFOOVR: FIFO overrun error interrupt flag
    \param[out] none
    \retval     none
*/
void edim_biss_interrupt_flag_clear(edim_biss_interrupt_flag_enum int_flag)
{
    EDIM_BISS_REG_VAL2(EDIM_BISS, int_flag) = BIT(EDIM_BISS_BIT_POS2(int_flag));
}
